zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_syscfg.h
/*!
    \file    gd32c2x1_syscfg.h
    \brief   definitions for the SYSCFG

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32C2X1_SYSCFG_H
#define GD32C2X1_SYSCFG_H

#include "gd32c2x1.h"

/* SYSCFG definitions */
#define SYSCFG                              SYSCFG_BASE

/* registers definitions */
#define SYSCFG_CFG0                         REG32(SYSCFG + 0x00U)                       /*!< system configuration register 0 */
#define SYSCFG_EXTISS0                      REG32(SYSCFG + 0x08U)                       /*!< EXTI sources selection register 0 */
#define SYSCFG_EXTISS1                      REG32(SYSCFG + 0x0CU)                       /*!< EXTI sources selection register 1 */
#define SYSCFG_EXTISS2                      REG32(SYSCFG + 0x10U)                       /*!< EXTI sources selection register 2 */
#define SYSCFG_EXTISS3                      REG32(SYSCFG + 0x14U)                       /*!< EXTI sources selection register 3 */
#define SYSCFG_CFG1                         REG32(SYSCFG + 0x18U)                       /*!< System configuration register 1 */
#define SYSCFG_STAT                         REG32(SYSCFG + 0x1CU)                       /*!< SYSCFG STAT register */
#define SYSCFG_CFG2                         REG32(SYSCFG + 0x28U)                       /*!< System configuration register 2 */
#define SYSCFG_CPU_IRQ_LAT                  REG32(SYSCFG + 0x100U)                      /*!< IRQ latency register */
#define SYSCFG_TIMERCFG0(syscfg_timerx)     REG32(SYSCFG + 0x110U + (syscfg_timerx)*8U)  /*!< TIMERx configuration register0 */
#define SYSCFG_TIMERCFG1(syscfg_timerx)     REG32(SYSCFG + 0x114U + (syscfg_timerx)*8U)  /*!< TIMERx configuration register1 */
#define SYSCFG_TIMER0CFG0                   REG32(SYSCFG + 0x110U)                      /*!< TIMER0 configuration register 0 */
#define SYSCFG_TIMER0CFG1                   REG32(SYSCFG + 0x114U)                      /*!< TIMER0 configuration register 1 */
#define SYSCFG_TIMER2CFG0                   REG32(SYSCFG + 0x118U)                      /*!< TIMER2 configuration register 0 */
#define SYSCFG_TIMER2CFG1                   REG32(SYSCFG + 0x11CU)                      /*!< TIMER2 configuration register 1 */

/* SYSCFG_CFG0 bits definitions */
#define SYSCFG_CFG0_BOOT_MODE               BITS(0,1)                                   /*!< SYSCFG memory remap config */
#define SYSCFG_CFG0_PA11_RMP                BIT(3)                                      /*!< PA11 remapping */
#define SYSCFG_CFG0_PA12_RMP                BIT(4)                                      /*!< PA12 remapping */
#define SYSCFG_CFG0_PB6_FMPEN               BIT(16)                                     /*!< I2C Fm+ mode on PB6 pin enable */
#define SYSCFG_CFG0_PB7_FMPEN               BIT(17)                                     /*!< I2C Fm+ mode on PB7 pin enable */
#define SYSCFG_CFG0_PB8_FMPEN               BIT(18)                                     /*!< I2C Fm+ mode on PB8 pin enable */
#define SYSCFG_CFG0_PB9_FMPEN               BIT(19)                                     /*!< I2C Fm+ mode on PB9 pin enable */
#define SYSCFG_CFG0_I2C0_FMPEN              BIT(20)                                     /*!< Fast Mode Plus (FM+) enable for I2C0  */
#define SYSCFG_CFG0_PA9_FMPEN               BIT(22)                                     /*!< I2C Fm+ mode on PA9 pin enable */
#define SYSCFG_CFG0_PA10_FMPEN              BIT(23)                                     /*!< I2C Fm+ mode on PA10 pin enable */
#define SYSCFG_CFG0_PC14_FMPEN              BIT(24)                                     /*!< I2C Fm+ mode on PC14 pin enable */

/* SYSCFG_EXTISS0 bits definitions */
#define SYSCFG_EXTISS0_EXTI0_SS             BITS(0,1)                                   /*!< EXTI 0 configuration */
#define SYSCFG_EXTISS0_EXTI1_SS             BITS(4,5)                                   /*!< EXTI 1 configuration */
#define SYSCFG_EXTISS0_EXTI2_SS             BITS(8,9)                                   /*!< EXTI 2 configuration */
#define SYSCFG_EXTISS0_EXTI3_SS             BITS(12,13)                                 /*!< EXTI 3 configuration */

/* SYSCFG_EXTISS1 bits definitions */
#define SYSCFG_EXTISS1_EXTI4_SS             BIT(0)                                      /*!< EXTI 4 configuration */
#define SYSCFG_EXTISS1_EXTI5_SS             BIT(4)                                      /*!< EXTI 5 configuration */
#define SYSCFG_EXTISS1_EXTI6_SS             BITS(8,9)                                   /*!< EXTI 6 configuration */
#define SYSCFG_EXTISS1_EXTI7_SS             BITS(12,13)                                 /*!< EXTI 7 configuration */

/* SYSCFG_EXTISS2 bits definitions */
#define SYSCFG_EXTISS2_EXTI8_SS             BIT(0)                                      /*!< EXTI 8 configuration */
#define SYSCFG_EXTISS2_EXTI9_SS             BIT(4)                                      /*!< EXTI 9 configuration */
#define SYSCFG_EXTISS2_EXTI10_SS            BIT(8)                                      /*!< EXTI 10 configuration */
#define SYSCFG_EXTISS2_EXTI11_SS            BIT(12)                                     /*!< EXTI 11 configuration */
                                                                                  
/* SYSCFG_EXTISS3 bits definitions */
#define SYSCFG_EXTISS3_EXTI12_SS            BIT(0)                                      /*!< EXTI 12 configuration */
#define SYSCFG_EXTISS3_EXTI13_SS            BITS(4,5)                                   /*!< EXTI 13 configuration */
#define SYSCFG_EXTISS3_EXTI14_SS            BITS(8,9)                                   /*!< EXTI 14 configuration */
#define SYSCFG_EXTISS3_EXTI15_SS            BITS(12,13)                                 /*!< EXTI 15 configuration */

