zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_syscfg.h
/* Internal trigger input source configuration bits definitions */
#define SYSCFG_TIMER_TRIG_INPUT_SOURCE_CONFIG(regval)       (SYSCFG_TSCFG8 & ((uint32_t)(regval) << 0))
#define TIMER_TRIG_INPUT_SOURCE_ITI0            SYSCFG_TIMER_TRIG_INPUT_SOURCE_CONFIG(1)                   /*!< Internal trigger input 0 */
#define TIMER_TRIG_INPUT_SOURCE_ITI2            SYSCFG_TIMER_TRIG_INPUT_SOURCE_CONFIG(3)                   /*!< Internal trigger input 2 */
#define TIMER_TRIG_INPUT_SOURCE_ITI3            SYSCFG_TIMER_TRIG_INPUT_SOURCE_CONFIG(4)                   /*!< Internal trigger input 3 */
#define TIMER_TRIG_INPUT_SOURCE_CI0F_ED         SYSCFG_TIMER_TRIG_INPUT_SOURCE_CONFIG(5)                   /*!< CI0 edge flag */

/* SYSCFG pin I2C Fm+ mode */
#define SYSCFG_PB6_FMPEN                        SYSCFG_CFG0_PB6_FMPEN                                      /*!< I2C Fm+ mode on PB6 pin enable */
#define SYSCFG_PB7_FMPEN                        SYSCFG_CFG0_PB7_FMPEN                                      /*!< I2C Fm+ mode on PB7 pin enable */
#define SYSCFG_PB8_FMPEN                        SYSCFG_CFG0_PB8_FMPEN                                      /*!< I2C Fm+ mode on PB8 pin enable */
#define SYSCFG_PB9_FMPEN                        SYSCFG_CFG0_PB9_FMPEN                                      /*!< I2C Fm+ mode on PB9 pin enable */
#define SYSCFG_I2C0_FMPEN                       SYSCFG_CFG0_I2C0_FMPEN                                     /*!< Fast Mode Plus (FM+) enable for I2C0  */
#define SYSCFG_PA9_FMPEN                        SYSCFG_CFG0_PA9_FMPEN                                      /*!< I2C Fm+ mode on PA9 pin enable */
#define SYSCFG_PA10_FMPEN                       SYSCFG_CFG0_PA10_FMPEN                                     /*!< I2C Fm+ mode on PA10 pin enable */
#define SYSCFG_PC14_FMPEN                       SYSCFG_CFG0_PC14_FMPEN                                     /*!< I2C Fm+ mode on PC14 pin enable */

/* SYSCFG module lockup */
#define SYSCFG_LOCKUP_LOCK                      SYSCFG_CFG1_LOCKUP_LOCK                                    /*!< CPU lockup signal connected  */
#define SYSCFG_SRAM_LOCKUP                      SYSCFG_CFG1_SRAM_ECC_LOCK                                  /*!< SRAM ECC check error signal connected */

/* SYSCFG flags */
#define SYSCFG_FLAG_ECCME                       SYSCFG_STAT_ECCMEIF                                        /*!< SRAM two bits non-correction event flag */ 
#define SYSCFG_FLAG_ECCSE                       SYSCFG_STAT_ECCSEIF                                        /*!< SRAM single bit correction event flag */

/* function declarations */
/* initialization functions */
/* reset the SYSCFG registers */
void syscfg_deinit(void);

/* enable I2C Fm+ mode */
void syscfg_i2c_fast_mode_plus_enable(uint32_t syscfg_gpio);
/* disable I2C Fm+ mode */
void syscfg_i2c_fast_mode_plus_disable(uint32_t syscfg_gpio);

/* enable remap pin function for small packages */
void syscfg_pin_remap_enable(uint32_t remap_pin);
/* disable remap pin function for small packages */
void syscfg_pin_remap_disable(uint32_t remap_pin);

/* get the boot mode */
uint8_t syscfg_bootmode_get(void);

/* configure the GPIO pin as EXTI Line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);

/* enable module lockup */
void syscfg_lockup_enable(uint32_t lockup);

/* get SRAM ECC single correctable bit */
uint32_t syscfg_sram_ecc_single_correctable_bit_get(void);
/* get SRAM ECC error address */
uint32_t syscfg_sram_ecc_error_address_get(void);

/* set the IRQ_LATENCY value */
void syscfg_irq_latency_set(uint32_t irq_latency);

/* enable interrupt */
void syscfg_interrupt_enable(uint32_t interrupt);
/* disable interrupt */
void syscfg_interrupt_disable(uint32_t interrupt);
/* interrupt flag get */
FlagStatus syscfg_interrupt_flag_get(uint32_t flag);
/* interrupt flag clear */
void syscfg_interrupt_flag_clear(uint32_t flag);

#endif /* gd32c2x1_SYSCFG_H */
